# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Working with JSON files

Import the pandas library

In [16]:
# Your import here:
import pandas as pd

####  After importing pandas, let's find a dataset. In this lesson we will be working with a NASA dataset.

Run the code in the cell below to load the dataset containing information about asteroids that have landed on earth. This piece of code helps us open the URL for the dataset and deocde the data using UTF-8.

In [3]:
# Run this code

from urllib.request import urlopen
import json

response = urlopen("https://data.nasa.gov/resource/y77d-th95.json")
json_data = response.read().decode('utf-8', 'replace')

#print(json_data)

In the next cell, load the data in `json_data` and load it into a pandas dataframe. Name the dataframe `nasa`.

In [4]:
# Your code here:
#nasa = pd.DataFrame(json_data)
#print(type(json_data))
#nasa
#print(json_data)

nasa = pd.read_json(json_data, orient='replace')
#nasa = pd.read_json(json_data)

Now that we have loaded the data, let's examine it using the `head()` function.

In [5]:
# Your code here:

nasa.head(3)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,geolocation,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4
0,Aachen,1,Valid,L5,21.0,Fell,1880-01-01T00:00:00.000,50.77500,6.08333,"{'type': 'Point', 'coordinates': [6.08333, 50....",NaN,NaN
1,Aarhus,2,Valid,H6,720.0,Fell,1951-01-01T00:00:00.000,56.18333,10.23333,"{'type': 'Point', 'coordinates': [10.23333, 56...",NaN,NaN
2,Abee,6,Valid,EH4,107000.0,Fell,1952-01-01T00:00:00.000,54.21667,-113.00000,"{'type': 'Point', 'coordinates': [-113, 54.216...",NaN,NaN

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [6]:
# Your code here:
nasa.value_counts('fall')

fall
Fell     996
Found      4
dtype: int64

Finally, let's save the dataframe as a json file again. Since we downloaded the file from an online source, the goal of saving the dataframe is to have a local copy. Save the dataframe using the `orient=records` argument and name the file `nasa.json`.

In [7]:
# Your code here:
nasa.to_json('vehicles/nasa.json', orient='records') #SE GUARDA EN CARPETA VEHICLES

# Challenge 2 - Working with CSV and Other Separated Files

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [8]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [9]:
# Your code here:
cols2 = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class', 'class2']
shuttle = pd.read_csv(tst_url, sep=' ')

#shuttle = pd.read_csv(tst_url, sep=' ')
#df = pd.DataFrame(shuttle, columns = cols)
shuttle.columns = cols2
#df.head(3)

Let's verify that this worked by looking at the `head()` function.

In [10]:
# Your code here:

shuttle.head(3)

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class,class2
0,56,0,96,0,52,-4,40,44,4,4
1,50,-1,89,-7,50,0,39,40,2,1
2,53,9,79,0,42,-2,25,37,12,4

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [11]:
# Your code here:

shuttle2 = shuttle.to_csv('vehicles/shuttle.csv', sep=',', index=False) #SE GUARDA EN CARPETA VEHICLES

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [12]:
# Your code here:

astroanut = pd.read_excel('astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [13]:
# Your code here:
astroanut.head(3)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [14]:
# Your code here:
astroanut.value_counts('Undergraduate Major')

Undergraduate Major
Physics                                  35
Aerospace Engineering                    33
Mechanical Engineering                   30
Aeronautical Engineering                 28
Electrical Engineering                   23
                                         ..
Marine Engineering & Nautical Science     1
Mathematical & Electrical Science         1
Biochemistry                              1
Mathematics & Economics                   1
Accounting                                1
Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [15]:
# Your code here:
astroanut2 = astroanut.to_csv('vehicles/astronaut.csv', sep='\t', index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [4]:
# Your code here:
#tst_url = 'https://archive.ics.uci.edu/ml/datasets.php'
#cols2 = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class', 'class2']
#fertility = pd.read_csv(tst_url, sep='\t')
#response2 = urlopen('https://archive.ics.uci.edu/ml/datasets.php')
#json_fertility = response2.read().decode('utf-8', 'replace')

fertility = pd.read_html('https://archive.ics.uci.edu/ml/datasets.php')

In [3]:
#https://pbpython.com/pandas-html-table.html
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
#https://data.nasa.gov/resource/y77d-th95.json
#https://archive.ics.uci.edu/ml/datasets.php
print(len(fertility))

629

In [5]:
print(type(fertility))

<class 'list'>

In [6]:
#data1 =fertility.to_csv('prueba.csv', index=False)
#print(fertility)

In [7]:
#a = pd.Series(fertility)
#print(a)

In [128]:
#a= fertility[0][0]

In [129]:
#print(a)

0    Center for Machine Learning and Intelligent Sy...
Name: 0, dtype: object

In [114]:
#b=[[1,2,3,4,5,6,7],[8,9,10,11,12,14],[15,16,17,18,19,10]]

In [123]:
#print(b[0][2])

3

In [171]:
#pd.DataFrame(fertility)

C:\Users\sistemas\anaconda3\lib\site-packages\pandas\core\internals\construction.py:576: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  values = np.array([convert(v) for v in values])

                                                     0
0                                                  ...
1                                                  ...
2                                 0
0  Browse Through:
3                                                  ...
4                   0                     1
0  622 ...
..                                                 ...
624      0                              1
0 NaN  Tu...
625      0                              1
0 NaN  Ma...
626      0                          1
0 NaN  Room O...
627      0                                         ...
628                 0   1                       2  ...

[629 rows x 1 columns]

In [15]:
import pandas as pd
#Se lee los datos de wikipedia de los países
#paises=pd.read_html('https://archive.ics.uci.edu/ml/datasets.php')

In [55]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt'

In [56]:
df_txt_data = pd.read_csv(url, sep=',')

#data2 = pd.read_csv('vehicles/vehicles_tab.txt', sep='\t')

In [57]:
#df_data = pd.DataFrame(muchos_datos
df_txt_data.head(3)

   -0.33  0.69  0  1  1.1  0.1  0.8  0.2  0.88  N
0  -0.33  0.94  1  0    1    0  0.8    1  0.31  O
1  -0.33  0.50  1  0    0    0  1.0   -1  0.50  N
2  -0.33  0.75  0  1    1    0  1.0   -1  0.38  N

In [58]:
ruta = 'fertility_Diagnosis.txt'

In [59]:
df_data = pd.read_csv(ruta, sep = ',')

In [60]:
df_data.head(3)

   -0.33  0.69  0  1  1.1  0.1  0.8  0.2  0.88  N
0  -0.33  0.94  1  0    1    0  0.8    1  0.31  O
1  -0.33  0.50  1  0    0    0  1.0   -1  0.50  N
2  -0.33  0.75  0  1    1    0  1.0   -1  0.38  N